/*****************************************************************************
* Copyright (C), 2013 杭州安米电子有限公司 www.mcuzone.com
* All rights reserved.
*
* 文件名: uart.h
* 内容简述: 配置初始化UART0,相关的UART0的相关发送与接收驱动函数
*
* 当前版本：Rev1.0
* 作者：Mcuzone-freescale
* 完成日期：2013.01.08
******************************************************************************/

#ifndef  __UART_H__
#define  __UART_H__


#include <stdint.h>
#include <stdarg.h>
#include <stdio.h>

#include "MK20D5.h"




/******************************************************************************
函数名称：UART0_Configuration
函数功能：串口0初始化配置为：波特率9600(模块时钟48MHz),8位数据位,1位停止位,无奇偶校验,
					无硬件流控制,传输时低位在前(LSB First)。
入口参数：无
出口参数：无
作者：Mcuzone-freescale
******************************************************************************/
void UART0_Configuration(void);



/******************************************************************************
函数名称：UART0_SendOneByte
函数功能：从串口0向外发送一字节数据
入口参数：buffer：待发送的一字节数据
出口参数：无
作者：Mcuzone-freescale
******************************************************************************/
void UART0_SendOneByte(uint8_t buffer);



/******************************************************************************
函数名称：UART0_ReadOneByte
函数功能：从串口0读取接收的一字节数据并返回
入口参数：无
出口参数：返回接收的一字节数据
作者：Mcuzone-freescale
******************************************************************************/
uint8_t UART0_ReadOneByte(void);



/******************************************************************************
函数名称：fputc
函数功能：软件重定义putc函数,这样可以利用printf函数从串口1打印输出信息
入口参数：
出口参数：
作者：Mcuzone-freescale
******************************************************************************/
int fputc(int ch, FILE *f);



/******************************************************************************
函数名称：fgetc
函数功能：软件重定义getc函数,这样可以利用scanf函数从串口1输入数据
入口参数：
出口参数：
作者：Mcuzone-freescale
******************************************************************************/
int fgetc(FILE *f);




#endif





